---
kind: property
id: P:Autodesk.Revit.DB.UnitTypeId.CurrencyPerSquareMeter
source: html/a0647d82-a157-48da-f9a2-20c1c3a249d8.htm
---
# Autodesk.Revit.DB.UnitTypeId.CurrencyPerSquareMeter Property

Cost per square meter.

## Syntax (C#)
```csharp
public static ForgeTypeId CurrencyPerSquareMeter { get; }
```